/*
함수 : 일련의 과정을 문을 표현하고 코드블록으로 감싸서 하나의 실행단위로 정의한 것. 즉, 미리 function이라는 키워드로 자주 쓰는 코드들을 묶어주는 행위이다. ==> 위치와 상관이 없다.(정적스코프) =>

함수 선언문일 경우 함수 호출, 참조 : 미리 정의되어 있는 함수를 식별자를 호출해야 실행됨.

함수를 사용하는 이유 : 함수로 일련의 과정을 하나의 실행단위로 정의하면, 여러번 같은 내용을 호출할 때 마다 사용할 수 있다. 즉, 코드를 재사용할 수 있다. 재사용성이 높은 함수는 유지 보수의 편의성과 같은 코드를 여러번 쓰면서 생길 수 있는 실수를 줄여서 코드의 신뢰성을 높일 수 있다.

함수는 일급 객체이므로 이름(식별자)를 붙일 수 있으며, 함수 이름도 변수 이름처럼 식별자를 보고도 기능을 유추할 수 있어야 한다. 함수 중에 이름이 없을 수도 있는데, 그것을 무명 또는 익명함수라고도 한다.

함수 리터럴은 function이라는 키워드, 함수이름, 매개변수목록, 함수 본체. 4가지로 구성된 함수를 식별할 수 있는 리터럴을 의미한다. 이 리터럴의 평가값은 객체이다.

함수를 생성하는 방법
    1. 함수 선언문 : 리터럴과 형태가 동일하지만 함수 선언문은 함수 이름을 생략할 수 없다. 함수 선언문으로 만들어진 함수는 표현식이 아니라 문이다.
        function test(){
            console.log("test");
        }
        test();

        function add(x,y){
            return x + y;
        }
        console.log(add(3, 4));

        function greet(name, place){ //매개변수 (parameter) : 넘겨받을 값을 사용하기 위해 함수 내부에서 정의하는 변수. 
        console.log(`Hello ${name}! Welcome to ${place}!!!`);

        (function test2(){ console.log("test")}); // 표현식이 아니라는 증거. ()를 감싸서 출력이 되면 표현식.
        test2();
        //  해당 함수 이름만 선언하고 변수는 선언하지 않았음에도 함수 선언문은 변수를 가진 것처럼 사용되는데, 그 이유는 암묵적으로 변수이름을 자바스크립트가 함수이름과 같은 이름으로 생성하기 때문이다 (호이스팅 발생)


        greet("도현", "우리인재개발원"); //인수 or 인자 (argument) : 함수 내부로 넘기는 값.

    2. 함수 표현식 : 자바스크립트에선 함수가 일급객체라고 했다. 즉, 함수는 값처럼 변수에 할당할 수도 있고, 객체 안에 프로퍼티로도 존재할 수 있으며(메소드) 값으로 취급되어 자유롭게 사용할 수 있다.

        let add = function(){ console.log("add") }; //무명, 익명 함수 표현식
        console.log(add); // ƒ (){ console.log("add") } 출력

        let add1 = function add1(){ //기명 함수 표현식

        }

        function test(){
            console.log("test");
        }

        test();
        console.log(test);
        console.log(test()); //undefined 출력

    3. 화살표 함수 : ES6 이후에 도입된 함수 생성 방법으로 키워드 대신 '=>'로 간략하게 선언할 수 있다. 다만 화살표 함수는 항상 익명함수로 정의된다. 그렇기 때문에 함수 선언문으로는 정의할 수 없고 오로지 표현식으로만 정의된다. 주로 콜백함수로 사용/정의할 떄 유용하다.

        const arrow = () => {} ;
        const arro = x => { console.log( x )} ; //매개변수가 하나인 경우 소괄호를 생략할 수 있다.
        const arr = x => x*2 ; //중괄호도 생략이 가능한데, 함수 몸체 내부의 문이 표현식이 아니면 에러가 발생한다.

        // const power = ()=> const x = 1; //에러 발생
        const power = () => { const x = 1; } //표현식이 아니기 떄문에 중괄호를 생략할 수 없다.

    함수 표현식과 함수 선언문의 차이점
        호이스팅 문제 : 함수표현식은 변수에 담겨져 있기 때문에 변수 호이스팅은 일어나지만 변수에 담긴 함수의 식별자는 호이스팅 되지 않는다. 또한 함수 선언문은 자바스크립트가 암묵적으로 변수이름을 정해주기 때문에 이미 함수의 존재를 알고 시작하며, 함수 호이스팅이 발생한다. 따라서 함수 선언문은 선언 전에 사용해도 오류가 나지 않지만, 함수 표현식은 반드시 함수 표현식 이후 참조 또는 호출해야 한다.

    함수 호출 시 주의점
        인수 확인 
            function add(x, y){
                return x + y;
            }
            console.log(add(2)); // 매개변수의 개수가 맞지 않음 
            console.log(add("a", "b")); // 매개변수가 개발자가 원하는 데이터 타입과 다름
            // 1) 자바스크립트는 매개변수와 인수의 갯수가 일치하는지 상관하지 않는다.
            // 2) 자바스크립트는 동적언어이기 때문에 타입을 사전에 정의할 수 없다.
            // 결론적으로 함수를 정의할 떄 반드시 적절한 인수가 들어오는지 확인하는 작업이 필요하다.       
          
            function add(x,y){
                //인수확인작업
                if(typeof x !== "number" || typeof y !== "number" ){
                    // console.log("숫자값으로만 입력하세요");
                    throw new TypeError("숫자값으로만 입력하세요")
                }

                return x + y ;
            }
            console.log(add(2)); // 매개변수의 개수가 맞지 않음 
            console.log(add("a", "b")); // 매개변수가 개발자가 원하는 데이터 타입과 다름

        함수 반환값(return) : 함수 내부의 값을 함수 외부로 반환하는 것이다. 함수 안에서 내보내고 싶은 값 앞에 return 키워드를 붙여준다. (반환문은 return 키워드 뒤에오는 표현식을 평가하고 외부로 반환) 사용하는 이유는 해당 함수의 결과값을 다른 곳에서 재활용할 수 있기 때문이다. 또한 함수 내부에서 구문 실행 도중에 return문을 만나면 강제로 함수가 종료된다. (반환문 이후 다른 문은 실행하지 않는다.)
            function plus(num1, num2){
                let result = num1 + num2;
                //함수 내부에서만 적용하고 휘발된 상황
                return result;
                // 리턴을 안해주면 함수를 호출해도 값은 undefined
            }

            console.log(plus(2, 3)); 
            
    함수의 형태
        1) 즉시 실행 함수 : 함수의 정의와 동시에 즉시 호출되는 함수를 의미한다. 하지만 이 함수는 한 번만 호출되고 다시 호출할 수 없다. 사용방법은 그룹 연사자()로 감싸고, 함수 실행할 때 사용하는 방법인 ()으로 마무리 짓는다.
        (function test(){})();
        (function test(){}());
        이렇게 감싸는 이유는 함수리터럴을 먼저 평가해서 함수 객체를 생성해야 사용할 수 있기 때문이다.

        let f= (function add(){
        let a = 3;
        let b = 4;
        return a + b;
        })();
        console.log(f);
        // 즉시 실행 함수도 일반적인 함수처럼 값을 반환할 수 있다.
        let res = (function(a,b){
        return a - b;
        })(5, 3);
        console.log(res);
        // 즉시 실행할 수도 일반함수처럼 인수를 전달할 수도 있다.   

        2) 중첩 함수 : 함수 내부에 정의된 함수를 중첩 함수 또는 내부 함수라고 한다. 중첩 함수를 포함한 함수를 외부 함수라고 한다. 중첩(내부)함수는 외부 함수 안에서만 호출할 수 있으며, 보통 이 중첩 함수의 역할은 외부 함수를 돕는 도우미 역할을 한다. 외부 함수가 내부 함수를 생성하는 목적은 외부함수의 기능을 분리하거나, 스코프를 나누거나하는 것이다. 
            function outer(){
                let x = 1;
                function inner(){
                    let y = 3;
                    console.log(x + y);
                    // 내부 함수는 외부 함수 변수의 변수를 사용할 수 있다.
                }
                inner();
            }
            outer();
            // inner(); //내부 함수이기 때문에 외부 함수에서만 호출 가능

        3) 콜백함수 : 함수의 매개변수를 통해서 다른 함수의 내부로 전달되는 함수를 말합니다. 매개변수를 통해 함수의 외부에서 콜백함수를 전달 받은 함수는 고차함수라고 합니다.
            중첩함수 - 외부함수
            콜백함수 = 고차함수는 헬퍼의 역할을 한다. 
            콜백함수는 고차 함수에 의해 호출되기 때문에, "고차 함수에 콜백함수를 사용(호출)이 아니라 콜백함수 자체가 전달되어야 한다."

                function add(){}
                add(function(){});
                function odd(){};
                add(odd();)

                const arr = [1, 2, 3];
                let res = arr.map((el, index) => {return el *2});
                // map 메소드가 하는 역할은 요소 하나하나 순차적으로 접근하여 콜백함수를 적용한다. 적용이 완료된 요소들을 모아 배열로 반환한다.
                console.log(res);

        === 기존에 배운 고차 함수 map

        4) 재귀함수 : 함수가 자기자신을 호출하는 것을 재귀호출이라고 하고, 재귀함수는 자신을 호출하는 행위, 즉 재귀호출을 하는 함수를 말한다. 반복문과 비슷한 효과를 가져올 수 있다. 재귀함수로도 반복처리되는 효과를 가질 수도 있지만, 반복문을 사용하는 것이 헐 낫다. 재귀함수는 자신을 무한하게 재귀호출하므로 반드시 탈출조건을 만들어야합니다. 그렇지 않으면 함수가 무한 호출되어 에러가 발생한다. requestAnimationFrame을 실습할 때 배워야한다.

        5) 순수함수와 비순수함수
            순수함수 : 외부 상태에 의존하지 않고, 외부상태를 변경하지도 않아서 부수적인 효과가 없으며, 결과적으로 항상 일정한 값을 변환하여 개발자가 예측이 가능한 함수
            
            비순수함수 : 외부 상태에 의존하고, 외부 상태를 변경하는 부수적인 효과가 있어서 외부에 따라 다른 값을 반환하여 개발자가 예측이 어려운 함수.




*/
// 순수 함수
// let count = 0;
// function plus(n){
//     return ++n;
// }
// count = plus(count);
// console.log(count);
// 외부값인 count와 독립적이며, 반환하는 값도 예측이 가능하다. count의 변경은 함수 내부가 아닌 외부에서 count가 변경이 된다.

//비순수 함수
let count = 0;
function plus(){
    return ++count;
    // 외부 변수인 count에 종속되고 외부상태인 외부변수 count를 직접 변경한다.
}
plus();
console.log(count);
// 외부 상태를 직접적으로 변경했기 때문에 현재의 값을 바로 예측하기 어렵다.



